#include "akao.h"

#include <sys/types.h>
#include <libspu.h>

/* transfer.c */

static volatile short AkaoTransferBusy;

void _AkaoTransferCallback(void)
{
    SpuSetTransferCallback(NULL);
    AkaoTransferBusy = 0;
}

void _AkaoSetTransferCallback(void)
{
    AkaoTransferBusy = 1;
    SpuSetTransferCallback(_AkaoTransferCallback);
}

void AkaoTransferWrite(void *addr, u_long size)
{
    _AkaoSetTransferCallback();
    SpuWrite(addr, size);
}

void AkaoTransferRead(void *addr, u_long size)
{
    _AkaoSetTransferCallback();
    SpuRead(addr, size);
}

void AkaoTransferFlush(void)
{
    while (AkaoTransferBusy)
    {
        /* do nothing */
    }
}

/* sndmain.c */

typedef struct _AKAO_INSTRUMENT {
    /* 0x00 */ u_int      addr;
    /* 0x04 */ u_int      loop_addr;
    /* 0x08 */ u_char     ar;
    /* 0x09 */ u_char     dr;
    /* 0x0A */ u_char     sl;
    /* 0x0B */ u_char     sr;
    /* 0x0C */ u_char     rr;
    /* 0x0D */ u_char     a_mode;
    /* 0x0E */ u_char     s_mode;
    /* 0x0F */ u_char     r_mode;
    /* 0x10 */ u_int      pitch[12];
} AKAO_INSTRUMENT;

typedef struct _AKAO_VOICE {
    /* 0x00 */ u_int      voice;
    /* 0x04 */ u_int      update_flags;
    /* 0x08 */ u_int      addr;
    /* 0x0C */ u_int      loop_addr;
    /* 0x10 */ u_int      a_mode;
    /* 0x14 */ u_int      s_mode;
    /* 0x18 */ u_int      r_mode;
    /* 0x1C */ u_short    pitch;
    /* 0x1E */ u_short    ar;
    /* 0x20 */ u_short    dr;
    /* 0x22 */ u_short    sl;
    /* 0x24 */ u_short    sr;
    /* 0x26 */ u_short    rr;
    /* 0x28 */ SpuVolume  volume;
} AKAO_VOICE;

typedef struct _AKAO_TRACK {
    /* 0x00 */ u_char    *addr;
    /* 0x04 */ u_char    *loop_addr[4];
    /* 0x14 */ u_char    *drum_addr;
    /* 0x18 */ u_char    *vibrato_addr;
    /* 0x1C */ short     *tremolo_addr;
    /* 0x20 */ short     *pan_addr;
    /* 0x24 */ u_int      overlay_voice;
    /* 0x28 */ u_int      alternate_voice;
    /* 0x2C */ u_int      master_volume;
    /* 0x30 */ u_int      pitch_of_note;
    /* 0x34 */ char       pad1[0x4];
    /* 0x38 */ u_int      effect_flags;
    /* 0x3C */ char       pad2[0x8];
    /* 0x44 */ u_int      volume;
    /* 0x48 */ int        volume_slope;
    /* 0x4C */ char       pad3[0x6];
    /* 0x52 */ u_short    field_52;
    /* 0x54 */ u_short    field_54;
    /* 0x56 */ u_short    delta_time_counter;
    /* 0x58 */ u_short    instrument;
    /* 0x5A */ char       pad4[0x2];
    /* 0x5C */ u_short    volume_slide_length_counter;
    /* 0x5E */ u_short    overlay_balance_slide_length_counter;
    /* 0x60 */ u_short    pan;
    /* 0x62 */ u_short    pan_slide_length;
    /* 0x64 */ char       pad5[0x2];
    /* 0x66 */ u_short    octave;
    /* 0x68 */ u_short    portamento_length;
    /* 0x6A */ u_short    previous_note_number;
    /* 0x6C */ u_short    portamento_speed;
    /* 0x6E */ u_short    legato_flags;
    /* 0x70 */ char       pad6[0x2];
    /* 0x72 */ u_short    vibrato_delay;
    /* 0x74 */ u_short    vibrato_delay_counter;
    /* 0x76 */ u_short    vibrato_rate;
    /* 0x78 */ u_short    vibrato_rate_counter;
    /* 0x7A */ u_short    vibrato_form;
    /* 0x7C */ u_short    vibrato_max_amplitude;
    /* 0x7E */ u_short    vibrato_depth;
    /* 0x80 */ u_short    vibrato_depth_slide_length_counter;
    /* 0x82 */ short      vibrato_depth_slope;
    /* 0x84 */ char       pad7[0x2];
    /* 0x86 */ u_short    tremolo_delay;
    /* 0x88 */ u_short    tremolo_delay_counter;
    /* 0x8A */ u_short    tremolo_rate;
    /* 0x8C */ u_short    tremolo_rate_counter;
    /* 0x8E */ u_short    tremolo_form;
    /* 0x90 */ u_short    tremolo_depth;
    /* 0x92 */ u_short    tremolo_depth_slide_length_counter;
    /* 0x94 */ short      tremolo_depth_slope;
    /* 0x96 */ char       pad8[0x2];
    /* 0x98 */ u_short    pan_lfo_rate;
    /* 0x9A */ u_short    pan_lfo_rate_counter;
    /* 0x9C */ u_short    pan_lfo_form;
    /* 0x9E */ u_short    pan_lfo_depth;
    /* 0xA0 */ u_short    pan_lfo_depth_slide_length_counter;
    /* 0xA2 */ short      pan_lfo_slope;
    /* 0xA4 */ u_short    noise_delay;
    /* 0xA6 */ u_short    freq_modulate_delay;
    /* 0xA8 */ char       pad9[0x10];
    /* 0xB8 */ u_short    loop_depth;
    /* 0xBA */ u_short    loop_delay[4];
    /* 0xC2 */ u_short    previous_delta_time;
    /* 0xC4 */ u_short    forced_delta_time;
    /* 0xC6 */ u_short    overlay_balance;
    /* 0xC8 */ short      overlay_balance_slope;
    /* 0xCA */ short      pan_slope;
    /* 0xCC */ short      transpose;
    /* 0xCE */ short      tuning;
    /* 0xD0 */ u_short    note;
    /* 0xD2 */ short      portamento_amount;
    /* 0xD4 */ short      previous_transpose;
    /* 0xD6 */ short      vibrato_lfo_amplitude;
    /* 0xD8 */ short      tremolo_lfo_amplitude;
    /* 0xDA */ short      pan_lfo_amplitude;
    /* 0xDC */ AKAO_VOICE attr;
} AKAO_TRACK;

typedef struct _AKAO_PLAYER {
    /* 0x00 */ u_int      channel_mode;
    /* 0x04 */ u_int      voice_mask;
    /* 0x08 */ u_int      keyons;
    /* 0x0C */ u_int      active;
    /* 0x10 */ u_int      keyoffs;
    /* 0x14 */ u_int      active_old;
    /* 0x18 */ u_int      tempo;
    /* 0x1C */ int        tempo_slope;
    /* 0x20 */ u_int      time;
    /* 0x24 */ u_int      overlay_mask;
    /* 0x28 */ u_int      alternate_mask;
    /* 0x2C */ u_int      noise_mask;
    /* 0x30 */ u_int      reverb_mask;
    /* 0x34 */ u_int      pitch_lfo_mask;
    /* 0x38 */ u_int      spucnt;
    /* 0x3C */ u_int      reverb_type;
    /* 0x40 */ u_int      reverb_depth;
    /* 0x44 */ int        reverb_depth_slope;
    /* 0x48 */ u_short    tempo_slide_length;
    /* 0x4A */ u_short    song_id;
    /* 0x4C */ u_short    last_condition;
    /* 0x4E */ u_short    condition;
    /* 0x50 */ u_short    reverb_depth_slide_length;
    /* 0x52 */ u_short    noise_clock;
    /* 0x54 */ u_short    field_54;
    /* 0x56 */ u_short    beats_per_measure;
    /* 0x58 */ u_short    beat;
    /* 0x5A */ u_short    ticks_per_beat;
    /* 0x5C */ u_short    tick;
    /* 0x5E */ u_short    measure;
} AKAO_PLAYER;

static AKAO_INSTRUMENT AkaoInstruments[128];
static AKAO_PLAYER AkaoPlayer;
static u_int       AkaoSpuControl; /* same as AkaoPlayer.spucnt */
static AKAO_TRACK AkaoTracks[24];

static u_short AkaoNoiseClock;

static int D_80062F04;

static u_int D_80099FCC;
static u_int D_80099FEC;
static u_int D_80099FF0;
static u_int D_80099FF4;

void *AkaoVibratoForms[16];

#define AKAO_EFFECT_VIBRATO 0x01
#define AKAO_EFFECT_TREMOLO 0x02
#define AKAO_EFFECT_PAN_LFO 0x04
#define AKAO_EFFECT_DRUM    0x08
#define AKAO_EFFECT_FREQMOD 0x10
#define AKAO_EFFECT_VOLMOD  0x20
#define AKAO_EFFECT_ALL     (AKAO_EFFECT_VIBRATO | AKAO_EFFECT_TREMOLO | AKAO_EFFECT_PAN_LFO | AKAO_EFFECT_DRUM | AKAO_EFFECT_FREQMOD | AKAO_EFFECT_VOLMOD)

INCLUDE_ASM("asm/nonmatchings/akao", func_800294BC);

INCLUDE_ASM("asm/nonmatchings/akao", func_800297A4);

INCLUDE_ASM("asm/nonmatchings/akao", func_80029818);

INCLUDE_ASM("asm/nonmatchings/akao", func_8002988C);

